using Microsoft.EntityFrameworkCore;
using Microsoft.Extensions.DependencyInjection;
using System;
using System.Linq;
using AspnetCoreMvcStarter.Data;
using AspnetCoreMvcStarter.Models.CrowdFunding;

namespace AspnetCoreMvcStarter.Models
{
    public static class SeedData
    {
        public static void Initialize(IServiceProvider serviceProvider)
        {
            using (var context = new AspnetCoreMvcStarterContext(
                serviceProvider.GetRequiredService<DbContextOptions<AspnetCoreMvcStarterContext>>()))
            {
                if (context == null || context.Transactions == null)
                {
                    throw new ArgumentNullException("Null AspnetCoreMvcStarterContext");
                }

                // Look for any transactions.
                if (!context.Transactions.Any())
                {
                  context.Transactions.AddRange(
                new Transactions
                {
                  Customer = "نوید محمدزاده",
                  TransactionDate = DateTime.Parse("1402-01-01"),
                  DueDate = DateTime.Parse("1402-01-10"),
                  Total = 100.50m,
                  Status = "paid"
                },
                new Transactions
                {
                  Customer = "سارا اعتمادی",
                  TransactionDate = DateTime.Parse("1402-02-15"),
                  DueDate = DateTime.Parse("1402-02-28"),
                  Total = 75.20m,
                  Status = "due"
                },
                new Transactions
                {
                  Customer = "ساعد سهیلی",
                  TransactionDate = DateTime.Parse("1402-03-10"),
                  DueDate = DateTime.Parse("1402-03-15"),
                  Total = 50.75m,
                  Status = "canceled"
                },
                new Transactions
                {
                  Customer = "پارسا پیروزفر",
                  TransactionDate = DateTime.Parse("1402-03-11"),
                  DueDate = DateTime.Parse("1402-03-25"),
                  Total = 90.65m,
                  Status = "due"
                },
                new Transactions
                {
                  Customer = "اتنا طهماسبی",
                  TransactionDate = DateTime.Parse("1402-05-10"),
                  DueDate = DateTime.Parse("1402-07-15"),
                  Total = 60.25m,
                  Status = "paid"
                }
            );
                }

              

                if (!context.Orders.Any())
                {
                  context.Orders.AddRange(
                    new Order { Id = 1, ProjectName = "وتامین", Benefit = "41%", StartTime = "10:23", Amount = "1000", Pay = "296" , Status=0 },
                    new Order { Id = 2, ProjectName = "آب و انرژی", Benefit = "35%", StartTime = "11:15", Amount = "2000", Pay = "450", Status = 0 }

                    );
                }

        if (!context.ProjectViews.Any())
        {
          context.ProjectViews.AddRange(
         new ProjectView
         {
           شناسه_طرح = 47,
           نام_طرح_یا_پروژه = "دستگاه شتابدهنده خطی پزشکی",
           مبلغ_مورد_نیاز = 37000000000,
           نوع_تامین_مالی_جمعی = "همه یا هیچ",
           وضعیت_طرح = "تایید نهایی موفقیت جمع آوری وجوه",
           تاریخ_تایید_شده_شروع_جمع_آوری_وجوه = DateTime.Parse("2022-02-15 00:00:00.000"),
           دوره_جمع_آوری_وجوه = 30,
           نام_عامل = "گروه پیشگامان کارآفرینی کارن",
           لینک_عامل = "https://www.karencrowd.com/home.html",
           موضوع_طرح = "شرکت دانش‌بنیان بهیار صنعت سپاهان برای اولین بار در کشور، موفق به طراحی و ساخت دستگاه شتابدهنده خطی پزشکی درمان سرطان با بالاترین درصد بومی‌سازی در کشور و چهارمین در دنیا شده است و ایران به این واسطه به جمع چند کشور محدود دارای این فناوری پیوسته است.",
           نام_شرکت = "بهیار صنعت سپاهان",
           نام_سکو= "مشاور سرمایه گذاری ارزش پرداز آریان",
           نماد_طرح = "کاربهیار",
           گروه_صنعت = "ابزارپزشکی، اپتیکی و اندازه‌گیری",
           زیرگروه_صنعت = "وسایل اندازه گیری غیر از کنترل صنعتی",
           حداقل_مبلغ_مورد_نیاز_جهت_موفقیت_تامین_مالی = 0,
           حداقل_مبلغ_سرمایه_گذاری_برای_تامین_کننده_حقیقی = 5000000,
           حداکثر_مبلغ_سرمایه_گذاری_برای_تامین_کننده_حقیقی = 1850000000,
           حداقل_مبلغ_سرمایه_گذاری_برای_تامین_کننده_حقوقی = 5000000,
           حداکثر_مبلغ_سرمایه_گذاری_برای_تامین_کننده_حقوقی = 37000000000,
           تاریخ_پیشنهادی_شروع_جمع_آوری_وجوه = DateTime.Parse("2022-02-15 00:00:00.000"),
           تاریخ_پیشنهادی_پایان_جمع_آوری_وجوه = DateTime.Parse("2022-03-17 00:00:00.000"),
           تاریخ_شروع_پروژه = DateTime.Parse("2022-03-18 00:00:00.000"),
           تاریخ_اتمام_پروژه = DateTime.Parse("2022-10-01 00:00:00.000"),
           تعداد_گواهی_شراکت_متقاضی = 3700000,
           کارمزد_فرابورس = 50000000,
           کارمزد_عامل = 720000000,
           نوع_وثیقه = "املاک",
           شناسه_ملی = "10260423426",
           شماره_ثبت_شرکت = "1144",
           تاریخ_ثبت_شرکت = DateTime.Parse("2003-12-13 00:00:00.000"),
           کد_اقتصادی_شرکت = "411171689657",
           نوع_شخصیت_حقوقی_شرکت = "2",
           کد_پستی_شرکت = "8415683121"
         },
            new ProjectView
            {
              شناسه_طرح = 48,
              نام_طرح_یا_پروژه = "کیت مولکولی تشخیص ویروس کرونا",
              مبلغ_مورد_نیاز = 10000000000,
              نوع_تامین_مالی_جمعی = "همه یا هیچ",
              وضعیت_طرح = "تایید نهایی موفقیت جمع آوری وجوه",
              تاریخ_تایید_شده_شروع_جمع_آوری_وجوه = DateTime.Parse("2022-02-14 00:00:00.000"),
              دوره_جمع_آوری_وجوه = 30,
              نام_عامل = "گروه پیشگامان کارآفرینی کارن",
              لینک_عامل = "https://www.karencrowd.com/home.html",
              موضوع_طرح = "همزمان با همه‌گیری ویروس کرونا، مهم‌ترین امر جهت پیشگیری از گسترش این ویروس، تشخیص این بیماری است. شرکت توپازژن کاوش با بهره‌گیری از به‌روزترین فناوری‌های تولید، اقدام به ساخت کیت تشخیص مولکولی کرونا به روش RT-PCR کرده است.",
              نام_شرکت = "توپاز ژن کاوش",
              نام_سکو = "مشاور سرمایه گذاری ارزش پرداز آریان",
              نماد_طرح = "کتوپازژن",
              گروه_صنعت = "ابزارپزشکی، اپتیکی و اندازه‌گیری",
              زیرگروه_صنعت = "وسایل اندازه گیری غیر از کنترل صنعتی",
              حداقل_مبلغ_مورد_نیاز_جهت_موفقیت_تامین_مالی = 0,
              حداقل_مبلغ_سرمایه_گذاری_برای_تامین_کننده_حقیقی = 5000000,
              حداکثر_مبلغ_سرمایه_گذاری_برای_تامین_کننده_حقیقی = 500000000,
              حداقل_مبلغ_سرمایه_گذاری_برای_تامین_کننده_حقوقی = 5000000,
              حداکثر_مبلغ_سرمایه_گذاری_برای_تامین_کننده_حقوقی = 10000000000,
              تاریخ_پیشنهادی_شروع_جمع_آوری_وجوه = DateTime.Parse("2022-02-14 00:00:00.000"),
              تاریخ_پیشنهادی_پایان_جمع_آوری_وجوه = DateTime.Parse("2022-03-16 00:00:00.000"),
              تاریخ_شروع_پروژه = DateTime.Parse("2022-03-17 00:00:00.000"),
              تاریخ_اتمام_پروژه = DateTime.Parse("2022-09-30 00:00:00.000"),
              تعداد_گواهی_شراکت_متقاضی = 1000000,
              کارمزد_فرابورس = 50000000,
              کارمزد_عامل = 400000000,
              نوع_وثیقه = "چک",
              شناسه_ملی = "10320811085",
              شماره_ثبت_شرکت = "26605",
              تاریخ_ثبت_شرکت = DateTime.Parse("2012-08-05 00:00:00.000"),
              کد_اقتصادی_شرکت = "411455146684",
              نوع_شخصیت_حقوقی_شرکت = "2",
              کد_پستی_شرکت = "3197996737"
            },
            new ProjectView
            {
              شناسه_طرح = 49,
              نام_طرح_یا_پروژه = "تجارت کالاهای مصرفی آریسا",
              مبلغ_مورد_نیاز = 19950000000,
              نوع_تامین_مالی_جمعی = "شناور",
              وضعیت_طرح = "تایید نهایی موفقیت جمع آوری وجوه",
              تاریخ_تایید_شده_شروع_جمع_آوری_وجوه = DateTime.Parse("2022-02-14 00:00:00.000"),
              دوره_جمع_آوری_وجوه = 27,
              نام_سکو = "سبدگردان الگوريتم",
              نام_عامل = "سامانه نگار آتنا",
              لینک_عامل = "dongi.ir",
              موضوع_طرح = "شرکت تجارت گستر آریسا تامین کننده کالای مصرفی برای سازمان‌های دولتی و نهادهای عمومی است.",
              نام_شرکت = "تجارت گستر آریسا",
              نماد_طرح = "دآریساتگ",
              گروه_صنعت = "تجارت عمده فروشی به جز وسایل نقلیه موتور",
              زیرگروه_صنعت = "عمده فروشی براساس هزینه و یا قرارداد",
              حداقل_مبلغ_مورد_نیاز_جهت_موفقیت_تامین_مالی = 10000000000,
              حداقل_مبلغ_سرمایه_گذاری_برای_تامین_کننده_حقیقی = 5000000,
              حداکثر_مبلغ_سرمایه_گذاری_برای_تامین_کننده_حقیقی = 997500000,
              حداقل_مبلغ_سرمایه_گذاری_برای_تامین_کننده_حقوقی = 50000000,
              حداکثر_مبلغ_سرمایه_گذاری_برای_تامین_کننده_حقوقی = 19950000000,
              تاریخ_پیشنهادی_شروع_جمع_آوری_وجوه = DateTime.Parse("2022-02-14 00:00:00.000"),
              تاریخ_پیشنهادی_پایان_جمع_آوری_وجوه = DateTime.Parse("2022-03-06 00:00:00.000"),
              تاریخ_شروع_پروژه = DateTime.Parse("2022-03-08 00:00:00.000"),
              تاریخ_اتمام_پروژه = DateTime.Parse("2023-03-08 00:00:00.000"),
              تعداد_گواهی_شراکت_متقاضی = 1995000,
              کارمزد_فرابورس = 50000000,
              کارمزد_عامل = 720000000,
              نوع_وثیقه = "سفته",
              شناسه_ملی = "14004650384",
              شماره_ثبت_شرکت = "465872",
              تاریخ_ثبت_شرکت = DateTime.Parse("2014-12-31 00:00:00.000"),
              کد_اقتصادی_شرکت = "411513714591",
              نوع_شخصیت_حقوقی_شرکت = "2",
              کد_پستی_شرکت = "1389794381",
              
            });
        }


        context.SaveChanges();
            }
        }
    }
}
